
import 'package:application/model_two/quran_total/%D8%A7%D9%84%D9%82%D9%84%D9%85_68.dart';
import 'package:application/model_two/quran_total/%D8%A7%D9%84%D9%85%D8%B9%D8%A7%D8%B1%D8%AC_70.dart';
import 'package:flutter/material.dart';



class O69 extends StatelessWidget {
  const O69({Key key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    final Color mainColor = Color(0xff181c27);
    final Color inactiveColor = Color(0xff5d6169);

    return Scaffold(
      backgroundColor: mainColor,
      appBar: AppBar(
        title: Center(child: Text("سورة  الحاقة ")),
        backgroundColor: mainColor,
      ),
      body: Container(
        padding: EdgeInsets.only(top: 10 , left: 10 ,right: 10),
        color: Colors.white,
        child: SingleChildScrollView(
            child: Column(
              children: [
                Text("""﷽""" , style: TextStyle(
                    fontSize: 40 ,
                    fontWeight: FontWeight.bold
                ),) ,
                Text("""الْحَاقَّةُ ﴿1﴾ مَا الْحَاقَّةُ ﴿2﴾ وَمَا أَدْرَاكَ مَا الْحَاقَّةُ ﴿3﴾ كَذَّبَتْ ثَمُودُ وَعَادٌ بِالْقَارِعَةِ ﴿4﴾ فَأَمَّا ثَمُودُ فَأُهْلِكُوا بِالطَّاغِيَةِ ﴿5﴾ وَأَمَّا عَادٌ فَأُهْلِكُوا بِرِيحٍ صَرْصَرٍ عَاتِيَةٍ ﴿6﴾ سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَثَمَانِيَةَ أَيَّامٍ حُسُومًا فَتَرَى الْقَوْمَ فِيهَا صَرْعَىٰ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ ﴿7﴾ فَهَلْ تَرَىٰ لَهُمْ مِنْ بَاقِيَةٍ ﴿8﴾ وَجَاءَ فِرْعَوْنُ وَمَنْ قَبْلَهُ وَالْمُؤْتَفِكَاتُ بِالْخَاطِئَةِ ﴿9﴾ فَعَصَوْا رَسُولَ رَبِّهِمْ فَأَخَذَهُمْ أَخْذَةً رَابِيَةً ﴿10﴾ إِنَّا لَمَّا طَغَى الْمَاءُ حَمَلْنَاكُمْ فِي الْجَارِيَةِ ﴿11﴾ لِنَجْعَلَهَا لَكُمْ تَذْكِرَةً وَتَعِيَهَا أُذُنٌ وَاعِيَةٌ ﴿12﴾ فَإِذَا نُفِخَ فِي الصُّورِ نَفْخَةٌ وَاحِدَةٌ ﴿13﴾ وَحُمِلَتِ الْأَرْضُ وَالْجِبَالُ فَدُكَّتَا دَكَّةً وَاحِدَةً ﴿14﴾ فَيَوْمَئِذٍ وَقَعَتِ الْوَاقِعَةُ ﴿15﴾ وَانْشَقَّتِ السَّمَاءُ فَهِيَ يَوْمَئِذٍ وَاهِيَةٌ ﴿16﴾ وَالْمَلَكُ عَلَىٰ أَرْجَائِهَا ۚ وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَانِيَةٌ ﴿17﴾ يَوْمَئِذٍ تُعْرَضُونَ لَا تَخْفَىٰ مِنْكُمْ خَافِيَةٌ ﴿18﴾ فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَيَقُولُ هَاؤُمُ اقْرَءُوا كِتَابِيَهْ ﴿19﴾ إِنِّي ظَنَنْتُ أَنِّي مُلَاقٍ حِسَابِيَهْ ﴿20﴾ فَهُوَ فِي عِيشَةٍ رَاضِيَةٍ ﴿21﴾ فِي جَنَّةٍ عَالِيَةٍ ﴿22﴾ قُطُوفُهَا دَانِيَةٌ ﴿23﴾ كُلُوا وَاشْرَبُوا هَنِيئًا بِمَا أَسْلَفْتُمْ فِي الْأَيَّامِ الْخَالِيَةِ ﴿24﴾ وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِشِمَالِهِ فَيَقُولُ يَا لَيْتَنِي لَمْ أُوتَ كِتَابِيَهْ ﴿25﴾ وَلَمْ أَدْرِ مَا حِسَابِيَهْ ﴿26﴾ يَا لَيْتَهَا كَانَتِ الْقَاضِيَةَ ﴿27﴾ مَا أَغْنَىٰ عَنِّي مَالِيَهْ ۜ ﴿28﴾ هَلَكَ عَنِّي سُلْطَانِيَهْ ﴿29﴾ خُذُوهُ فَغُلُّوهُ ﴿30﴾ ثُمَّ الْجَحِيمَ صَلُّوهُ ﴿31﴾ ثُمَّ فِي سِلْسِلَةٍ ذَرْعُهَا سَبْعُونَ ذِرَاعًا فَاسْلُكُوهُ ﴿32﴾ إِنَّهُ كَانَ لَا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ ﴿33﴾ وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ ﴿34﴾ فَلَيْسَ لَهُ الْيَوْمَ هَاهُنَا حَمِيمٌ ﴿35﴾ وَلَا طَعَامٌ إِلَّا مِنْ غِسْلِينٍ ﴿36﴾ لَا يَأْكُلُهُ إِلَّا الْخَاطِئُونَ ﴿37﴾ فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ ﴿38﴾ وَمَا لَا تُبْصِرُونَ ﴿39﴾ إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ ﴿40﴾ وَمَا هُوَ بِقَوْلِ شَاعِرٍ ۚ قَلِيلًا مَا تُؤْمِنُونَ ﴿41﴾ وَلَا بِقَوْلِ كَاهِنٍ ۚ قَلِيلًا مَا تَذَكَّرُونَ ﴿42﴾ تَنْزِيلٌ مِنْ رَبِّ الْعَالَمِينَ ﴿43﴾ وَلَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْأَقَاوِيلِ ﴿44﴾ لَأَخَذْنَا مِنْهُ بِالْيَمِينِ ﴿45﴾ ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِينَ ﴿46﴾ فَمَا مِنْكُمْ مِنْ أَحَدٍ عَنْهُ حَاجِزِينَ ﴿47﴾ وَإِنَّهُ لَتَذْكِرَةٌ لِلْمُتَّقِينَ ﴿48﴾ وَإِنَّا لَنَعْلَمُ أَنَّ مِنْكُمْ مُكَذِّبِينَ ﴿49﴾ وَإِنَّهُ لَحَسْرَةٌ عَلَى الْكَافِرِينَ ﴿50﴾ وَإِنَّهُ لَحَقُّ الْيَقِينِ ﴿51﴾ فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ ﴿52﴾"""



                  , style: TextStyle(fontWeight: FontWeight.bold , fontSize: 20),
                ) ,
                Container(
                  width: double.infinity,
                  child: ElevatedButton(
                    style: ElevatedButton.styleFrom(
                        primary: mainColor,
                        textStyle: TextStyle(
                            fontSize: 20, fontWeight: FontWeight.bold),
                        shape: RoundedRectangleBorder(
                            borderRadius: BorderRadius.circular(29))),
                    onPressed: () {
                      Navigator.of(context).push(MaterialPageRoute(builder: (context){
                        return O68() ;
                      }));
                    },
                    child: Text("السورة السابقة : سورة القلم"),
                  ),
                ),
                Container(
                  width: double.infinity,
                  child: ElevatedButton(
                    style: ElevatedButton.styleFrom(
                        primary: mainColor,
                        textStyle: TextStyle(
                            fontSize: 20, fontWeight: FontWeight.bold),
                        shape: RoundedRectangleBorder(
                            borderRadius: BorderRadius.circular(29))),
                    onPressed: () {
                      Navigator.of(context).push(MaterialPageRoute(builder: (context){
                        return  O70() ;
                      }));
                    },
                    child: Text("السورة التالية : سورة  المعارج "),
                  ),
                ),
              ],
            )
        ),
      ),
    );
  }
}
