import 'package:flutter/material.dart';

class NamesTwo extends StatefulWidget {
  const NamesTwo({Key key}) : super(key: key);

  @override
  _NamesTwoState createState() => _NamesTwoState();
}

class _NamesTwoState extends State<NamesTwo> {
  int _currentIndex = 0;

  double screenHeight = 0;
  double screenWidth = 0;
  final Color mainColor = Color(0xff181c27);
  final Color inactiveColor = Color(0xff5d6169);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.white,
        appBar: AppBar(
          backgroundColor: mainColor,
        ),
        body: Padding(
          padding: const EdgeInsets.all(13),
          child: Container(
              color: Colors.white,
              padding: EdgeInsets.only(top: 10, left: 10, right: 10),
              child: SingleChildScrollView(
                child: Column(
                  mainAxisAlignment: MainAxisAlignment.start,
                  children: [
                    Container(
                      padding: EdgeInsets.only(left: 10, right: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      //  ,
                      child: Text("الدعاء باسماء الله الحسنى",
                          style: TextStyle(
                              fontSize: 30,
                              color: Colors.cyan,
                              fontWeight: FontWeight.bold)),
                    ),
                    Divider(),
                    Container(
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      padding: EdgeInsets.only(top: 12, bottom: 12, right: 10),
                      child: Row(
                        crossAxisAlignment: CrossAxisAlignment.start,
                        mainAxisAlignment: MainAxisAlignment.start,
                        children: [
                          Text("قال رسول الله ـ صلى الله عليه وسلم :-",
                             style: TextStyle(
                                 fontSize: 22,
                                 color: Colors.cyan,
                                 fontWeight: FontWeight.bold)),
                        ],
                      ),
                    ),
                    Divider(),
                    Text("""الدعاء باسماء الله الحسنى
من أفضل وأحب العبادات إلى المسلم الحق هو الدعاء، ولا سيما إذا كان دعائه بأسماء الله الحسنى، ولهذا نوضح لكم بعض أبرز الأدعية باسماء الله الحسنى كالتالي:
""", style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold)),
                    Divider(),
                    Container(
                      padding: EdgeInsets.only(
                          left: 10, right: 10, bottom: 10, top: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      child: Text(
                          """يا مَنْ لَمْ يلِدْ، وَلَمْ يولَدْ، وَلَمْ يكُنْ لَهُ كُفُواً أَحَدٌ. يا مَنْ لاَ ينسَى مَن ذَكَرَهُ، وَلاَ يخَيبُ مَن رَجَاهُ، وَلاَ يكِلُ مَن تَوَكَّلَ عَلَيْهِ إلَى غَيرِهِ.يا مُؤنِسَ كُلِّ وَحِيدٍ، وَيا صَاحِبَ كُلِّ فَريد، وَيا قَرِيبًا غَيرَ بَعِيدٍ، يا مَنْ أَظْهَرَ الْجَمِيلَ وَسَتَرَ الْقَبِيحَ.
                          
                          
يا الله يا مالك الملك يا ذا الجلال والإكرام يا حي يا قيوم يا واسع يا مجيب يا عفو يا غفّار يا برّ يا توّاب يا هادي يا رشيد يا لطيف يا ستار يسر لي الالتزام بدينك بخفي لطفك.


يا حي يا قيوم برحمتك أستغيث، لا تكلني إلي نفسي طرفة عين وأصلح لي شأني كله.

اللهم إنا نسألك بأسمائك الحسنى وكلماتك التامّاتِ ما علمنا منها وما لم نعلم.. أن تغفـرَ لنا ولأحبابنـا أبـداً وللمسلمين كلَّ ذنب، وتستر لنا كلَّ عيب، وتكشف عنا كلَّ كرب، وتصرف وترفع عنا كلَّ بلاء، وتُعافينـا من كلِّ محنةٍ وفتنةٍ وشِدَّةٍ في الدارين، وتقضي لنا كلَّ حاجةٍ فيهما.. يا من هـو الله الذي لا إلـه إلاّ هـو، يا عالِم الغيب والشَّهادة سبحانك لا إله إلاّ أنت يا ذا الجلال والإكرام..أسألك باسمك الأعلى الأعـزِّ الأجـلِّ الأكرم، يا ذا الجلال والإكرام، والمواهب العظام
يامغيث أغثني.

اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الرَّحْمَنِ الرَّحِيمِ أَنْ تَتَجَلَّى عَلَى قَلْبِي وَتَمْلأَهُ نُوراً وَأَنْ تُؤَيِّدَنِي بِالنَّصْرِ وَالْحِفْظِ وَالتَّوْفِيقِ.

أَسْأَلُكَ بِاسْمِكَ الْمَلِكِ أَنْ تُمَلِّكَنِي نَفْسِي وَلاَ تَجْعَلْهَا تَمْتَلِكَنِي حَتَّى لاَ تَعِزَّ إِلاَّ بِكَ وَلاَ تَذِلَّ إِلاَّ لَكَ.

أَسْأَلُكَ بِاسْمِكَ القُدّوسِ أَنْ تُطَهِّرَ قَلْبِي مِنْ مَسَالِكِ الغَفَلاَتِ، وَرُوحِي عَنْ فُتُورِ الْمُسَاكَنَاتِ، وَوَقْتِي عَنْ دَنَسِ الْمُخَالَفَاتِ، وَسِرِّي عَنِ الْمُلاَحَظَاتِ وَالإِلْتِفَاتاتِ.

أَسْأَلُكَ بِاسْمِكَ السَّلاَمِ أَنْ تَبُثَّ فِي قَلْبِيَ السَّلاَمَ، وَأَنْ تَهْدِيَنِي سُبُلَ السَّلاَمِ، وَأَنْ تَرْزُقَنِي سَلاَمَةَ الصَّدْرِ وَأَنْ تُطَهِّرَ نَفْسِي مِنَ العُيُوبِ وَالآثاَمِ.

أَسْأَلُكَ بِاسْمِكَ الْمُؤْمِنِ أَنْ تَجْعَلَنِي مَأْمُونَ الْجَانِبِ، وَأَنْ تَجْعَلَ أَعْمَالِي مِصْدَاقاً لأَقْوَالِي، وَءَامِنِّي يَوْمَ الفَزَعِ الأَكْبَرِ.

أَسْأَلُكَ بِاسْمِكَ الْمُهَيْمِنِ أَنْ تُهَيْمِنَ عَلَى جَوَارِحِي وَقَلْبِي وَتَحْفَظَهُمَا عَنْ كُلِّ مَا لاَ يُرْضِيكَ.

أَسْأَلُكَ بِاسْمِكَ العَزِيزِ أَنْ تُعِزَّنِي بِطَاعَتِكَ وَبِالإِقْبَالِ عَلَيْكَ وَالإِسْتِغْنَاءِ عَنِ النَّاسِ.

أَسْأَلُكَ بِاسْمِكَ الْجَبَّارِ أَنْ تَجْبُرَ قَلْبَ كُلِّ كَسِيرٍ وَحَزِينٍ وَأَنْ تَجْبُرَ لَنا أَعْمَالَنا.""",
                          style: TextStyle(
                              fontSize: 22,
                              color: Colors.cyan,
                              fontWeight: FontWeight.bold)),
                    ),
                    Divider(
                      height: 30,
                    ),
                    Container(
                      padding: EdgeInsets.only(
                          left: 10, right: 10, bottom: 10, top: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      child: Text("""معاني أسماء الله الحسنى""",
                          style: TextStyle(
                              fontSize: 22,
                              color: Colors.cyan,
                              fontWeight: FontWeight.bold)),
                    ),
                    Divider(
                      height: 32,
                    ),
                    Text("""الأحد: المنفرد ليس معه غيره
الأول: لا شيء قبله ووجوده سبحانه ذاتي
البارئ: الخالق لما فيه روح
الباسط: موسع الرزق والعلم وموسع ما شاء من كونه ومخلوقاته ورحمته
الباطن: لا يعلم أحد ذاته
الباعث: باعث الرسل إلى الناس وباعث الموتى من القبور وباعث الحياة كلها
الباقي: لا يناله تغير ولا تبدل ولا زوال
البديع: أوجد كل شيء ولا مثيل له
البر: كثير العطايا والإحسان
البصير: المبصر العالم الخبير من أسمائه تعالى
التواب: يقبل توبة عباده
الجامع: يجمع شتات الحقائق والخلائق في الدنيا والآخرة
الجبار: المنفذ لأمره دون اعتراض
الجليل: له صفات الجلال
الحسيب: يكفي عباده ويحاسبهم
الحفيظ: يحفظ عباده وكونه من الخلل والاضطراب ويحفظ أعمال العباد للحساب
الحق: هو الحق بذاته وأمره حق
الحكم: الحاكم الذي لا راد لقضائه ولا معقب لحكمه الحكم من يفصل بين المتنازعين ويحكم في الأمور وبين الناس
الحكيم: المدبر بحكمة عليا
الحليم: الصفوح الستير ذو الحلم
الحميد: المحمود بذاته
الحي: له الحياة الكاملة والدائمة والذاتية
الخافض: يخفض من يستحق الخفض
الخالق: الموجد للمخلوقات
الخبير: العليم ذو الخبرة التامة العالم بكنه الأشياء وحقائقها
الرؤوف: عظيم الرأفة والرحمة
الرافع: يرفع من يستحق من عباده وما شاء من كونه
الرحمن: المنعم بجلائل النعم
الرحيم: المنعم بدقائق النعم
الرزاق: خالق الرزق وأسباب الرزق ومقدر الأرزاق
الرشيد: المرشد لعباده
الرقيب: يراقب كل صغيرة وكبيرة ولا يغيب عنه شيء مهما دق
السلام: الأمان لخلقه وواهب السلام لعباده
السميع: المسمع والسامع وهو للمبالغة يسمع تعالى كل الأصوات والكلمات ويستجيب لعبيده
الشكور: يعطي الكثير على القليل
الشهيد: العالم بكل مخلوق
الصبور: لا يتعجل بالعقوبة وكل شيء عنده بحكمة ومقدار
الصمد: يقصد وحده
الضار: ينزل غضبه على من عصاه
الظاهر: أظهر وجوده بآياته
العدل: العادل الكامل في عدالته
العزيز: الغالب
العظيم: البالغ أقصى مراتب العظمة والجلال والكمال
العفو: يمحو سيئات من يستغفره
العلي: المتعال ولا يدركه أحد
العليم: العالم بكل شيء ولا يغيب عنه شيء
الغفار: كثير المغفرة وستر الذنوب
الغفور: كثير الغفران
الغني: المستغني بذاته عن سواه من الخلق وكل الوجود مفتقر إليه
الفتاح: الذي يفتح خزائن رحمته لعباده
القابض: قابض الأرواح والأرزاق والقابض على السماوات والأرض والكون
القادر: القوي
القدوس: المتعالي عن كل النقائص
القهار: القابض على كل شيء والقاهر لكل الخلائق
القوي: بذاته ولا يحتاج إلى سواه
القيوم: القائم بنفسه والمقيم لشؤون عباده
الكبير: لا تستطيع الحواس والعقول إدراكه
الكريم: يعطي من غير سؤال أو بديل
اللطيف: العالم بخفايا الأمور ودقائقها البر بعباده المحسن إليهم
الله: علم على الذات الإلهية المقدسة
المؤخر: الذي يؤخر الثواب والعقاب والأجل إلى وقت معلوم عنده
المؤمن: المؤمِّن لخلقه من العذاب والخوف
الماجد: له المجد والكبرياء
المانع: يمنع أسباب الهلاك ويمنع ما شاء وعمن يشاء
المبدئ: الخالق
المتعالي: المنزه عن مشابهة خلقه
المتكبر: المنفرد بذاته بالعظمة
المتين: لا يغلب ولا يقهر
المجيب: يستجيب دعاء عباده
المجيد: له المجد الأعلى كله
المحصي: لا يغيب عنه شيء
المحيي: خالق الحياة في كل حي
المدبر: يقضي أمر ملكه ويدبر الكائنات
المذل: يُذِلّ أعداءه وعُصاته
المصور: المعطي كل شيء صورة تميزه
المعز: يُعِزّ من استمسك بدينه
المعيد: يعيد الخلق والحياة
المغني: المتفضل بإغناء سواه
المقتدر: المتمكن من الشيء
المقدم: يقدر الأشياء والأوامر فيقدم بعضها على بعض وفق حكمته
المقسط :يعطي كل ذي حق حقه
المقيت: يكفل خلقه بالبقاء والنماء
الملك: المتصرف بملكه كيف يشاء
المميت: سالب الحياة من الأحياء
المنتقم: المعاقب لمن يستحق العقوبة
المهيمن: المسيطر
النافع: يعم خيره كل الوجود
النور: الظاهر بنفسه والمظهر لغيره
الهادي: يهدي إليه عباده ويهدي كل مخلوق إلى أسباب بقائه وطريق حياته
الواجد: لا يحتاج لعون فكل ما يريده يكون
الواحد :المنفرد الذي لا نظير له
الوارث: الباقي بعد فناء الموجودات
الواسع: عمت رحمته كل شيء ووسع علمه كل شيء
الوالي: يتابع الأشياء ويناصر من يشاء
الودود: المحسن لعباده
الوكيل: القائم بأمور عباده وبكل ما يحتاجون
الولي: يتولى أمر خلقه بالرعاية
الوهاب: كثير النعم دائم العطايا
بديع: خالق مبدع جميل رائع محدث عجيب
ذو الجلال والإكرام: له الكمال والجلال والإنعام""" , style: TextStyle(
                        fontSize: 20,
                        //color: Colors.white70,
                        fontWeight: FontWeight.bold)),

                    Divider(
                      height: 32,
                    ),
                    Container(
                      padding: EdgeInsets.only(
                          left: 10, right: 10, bottom: 10, top: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      child: Text("""وهنا يجب التنبيه على أن هذا السرد المشهور والمتداول لأسماء الله الحسنى بهذا الترتيب لا يصح عن النبي صلى الله عليه سلم وإنما هو مدرج في الحديث، وقد رواه الترمذي وقال: حديث غريب.""",
                          style: TextStyle(
                              fontSize: 22,
                              color: Colors.cyan,
                              fontWeight: FontWeight.bold)),
                    ),
                    Divider(
                      height: 32,
                    ),
                    Container(
                      padding: EdgeInsets.only(
                          left: 10, right: 10, bottom: 10, top: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      child: Text("""وذكر شيخ الإسلام ابن تيمية أن التسعة والتسعين اسما لم يرد في تعيينها حديث صحيح عن النبي صلى الله عليه وسلم، وأشهر ما عند الناس فيها حديث الترمذي الذي رواه الوليد بن مسلم عن شعيب بن أبي حمزة، وحفاظ أهل الحديث يقولون هذه الزيادة مما جمعه الوليد بن مسلم عن شيوخه من أهل الحديث. اه""",
                          style: TextStyle(
                              fontSize: 22,
                              color: Colors.cyan,
                              fontWeight: FontWeight.bold)),
                    ),
                    Divider(
                      height: 32,
                    ),
                    Container(
                      padding: EdgeInsets.only(
                          left: 10, right: 10, bottom: 10, top: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      child: Text("""وقال ابن القيم: الصحيح أنه ـ أي العد ـ ليس من كلام النبي صلى الله عليه وسلم، وقال ابن كثير: والذي عول عليه جماعة من الحفاظ أن سرد الأسماء في هذا الحديث مدرج فيه، وإنما ذلك كما رواه الوليد بن مسلم وعبد الملك بن محمد الصنعاني عن زهير أنه بلغه عن غير واحد من أهل العلم أنهم قالوا ذلك، أي أنهم جمعوها من القرآن، كما روي عن جعفر بن محمد وسفيان بن عيينة وأبي زيد الغلوي ـ والله أعلم. اهـ.""",
                          style: TextStyle(
                              fontSize: 22,
                              color: Colors.cyan,
                              fontWeight: FontWeight.bold)),
                    ),
                    Divider(
                      height: 32,
                    ),
                    Container(
                      padding: EdgeInsets.only(
                          left: 10, right: 10, bottom: 10, top: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      child: Text("""وذكر الصنعاني اتفاق الحفاظ من أئمة الحديث أن سردها إدراج من بعض الرواة، كما تجدر الإشارة إلى تضعيف هذا الحديث من قبل جماعة من الأئمة وعلماء الحديث كابن حزم، وابن العربي، والداودي، والألباني.""",
                          style: TextStyle(
                              fontSize: 22,
                              color: Colors.cyan,
                              fontWeight: FontWeight.bold)),
                    ),
                    Divider(
                      height: 32,
                    ),
                    Container(
                      padding: EdgeInsets.only(
                          left: 10, right: 10, bottom: 10, top: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      child: Text("""وقال ابن القيم: الصحيح أنه ـ أي العد ـ ليس من كلام النبي صلى الله عليه وسلم، وقال ابن كثير: والذي عول عليه جماعة من الحفاظ أن سرد الأسماء في هذا الحديث مدرج فيه، وإنما ذلك كما رواه الوليد بن مسلم وعبد الملك بن محمد الصنعاني عن زهير أنه بلغه عن غير واحد من أهل العلم أنهم قالوا ذلك، أي أنهم جمعوها من القرآن، كما روي عن جعفر بن محمد وسفيان بن عيينة وأبي زيد الغلوي ـ والله أعلم. اهـ.""",
                          style: TextStyle(
                              fontSize: 22,
                              color: Colors.cyan,
                              fontWeight: FontWeight.bold)),
                    ),
                    Divider(
                      height: 32,
                    ),
                    Container(
                      padding: EdgeInsets.only(
                          left: 10, right: 10, bottom: 10, top: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: mainColor),
                      child: Text("""وقال ابن القيم: الصحيح أنه ـ أي العد ـ ليس من كلام النبي صلى الله عليه وسلم، وقال ابن كثير: والذي عول عليه جماعة من الحفاظ أن سرد الأسماء في هذا الحديث مدرج فيه، وإنما ذلك كما رواه الوليد بن مسلم وعبد الملك بن محمد الصنعاني عن زهير أنه بلغه عن غير واحد من أهل العلم أنهم قالوا ذلك، أي أنهم جمعوها من القرآن، كما روي عن جعفر بن محمد وسفيان بن عيينة وأبي زيد الغلوي ـ والله أعلم. اهـ.""",
                          style: TextStyle(
                              fontSize: 22,
                              color: Colors.cyan,
                              fontWeight: FontWeight.bold)),
                    ),
                  ],
                ),
              )),
        ));
  }
}
